In [1]:
import numpy as np
import pandas as pd

# Text Metods

In [2]:
names = pd.Series(["Ali","Deli","Veli","Zeli","56"])

In [3]:
names

0     Ali
1    Deli
2    Veli
3    Zeli
4      56
dtype: object

In [4]:
names.str.upper()

0     ALI
1    DELI
2    VELI
3    ZELI
4      56
dtype: object

In [5]:
names = pd.Series(["Ali","Deli","Veli","Zeli","56", 4.2])

In [6]:
names

0     Ali
1    Deli
2    Veli
3    Zeli
4      56
5     4.2
dtype: object

In [7]:
names.str.islower()

0    False
1    False
2    False
3    False
4    False
5      NaN
dtype: object

In [8]:
names = pd.Series(["ali","Deli","Veli","Zeli","56", 4.2])

In [9]:
names.str.islower()

0     True
1    False
2    False
3    False
4    False
5      NaN
dtype: object

In [10]:
names = pd.Series(["ali","Deli","Veli","Zeli","56"])

In [11]:
names.str.islower()

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [12]:
names[names.str.islower()]

0    ali
dtype: object

In [13]:
names[~names.str.isnumeric()]

0     ali
1    Deli
2    Veli
3    Zeli
dtype: object

In [14]:
comps = ["QNB,BBVA,GP","Ford,Audi,BMW"]

In [15]:
comp= pd.Series(comps)

In [16]:
comps[0].split(",")

['QNB', 'BBVA', 'GP']

In [17]:
comp.str.split(",")

0      [QNB, BBVA, GP]
1    [Ford, Audi, BMW]
dtype: object

In [18]:
comp.str.split(",").str[0]

0     QNB
1    Ford
dtype: object

In [19]:
comp.str.split(",", expand=True)

      0     1    2
0   QNB  BBVA   GP
1  Ford  Audi  BMW

In [20]:
isimler = pd.Series(["ali","Del??i","Vel??i","Zel??i","56"])

In [21]:
isimler

0       ali
1    Del??i
2    Vel??i
3    Zel??i
4        56
dtype: object

In [22]:
def func(x):
    return x.replace("??", "")

In [23]:
isimler.str.replace("?", "")

C:\Users\user\AppData\Local\Temp/ipykernel_5912/3063056128.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  isimler.str.replace("?", "")

0     ali
1    Deli
2    Veli
3    Zeli
4      56
dtype: object

In [24]:
isimler.str.replace("\?", "", regex=True)

0     ali
1    Deli
2    Veli
3    Zeli
4      56
dtype: object

In [115]:
isimler.str.extract("([\w]+)")

     0
0  ali
1  Del
2  Vel
3  Zel
4   56

In [26]:
isimler.str.find("e")

0   -1
1    1
2    1
3    1
4   -1
dtype: int64

In [27]:
isimler.str.findall("([0-9]+)")

0      []
1      []
2      []
3      []
4    [56]
dtype: object

In [28]:
import seaborn as sns

In [29]:
df = sns.load_dataset("titanic")

In [30]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [31]:
df.embark_town = df.embark_town.str.lower()

In [32]:
df.embark_town.head(3)

0    southampton
1      cherbourg
2    southampton
Name: embark_town, dtype: object

In [33]:
df.sex = df.sex.str.upper()
df.sex.head()

0      MALE
1    FEMALE
2    FEMALE
3    FEMALE
4      MALE
Name: sex, dtype: object

In [34]:
df.sex.head().str.islower()  # stringdeki bütün karakterlerin küçük harf olup olmadığına bakmak için

0    False
1    False
2    False
3    False
4    False
Name: sex, dtype: bool

In [35]:
df.sex.head().str.isupper() # stringdeki bütün karakterlerin büyük harf olup olmadığına bakmak için

0    True
1    True
2    True
3    True
4    True
Name: sex, dtype: bool

In [36]:
df.pclass.astype("string").str.isdigit().head(3)  # pclass sütunundaki verilerin digit(sayısal) olup olmadığına bakmak için

0    True
1    True
2    True
Name: pclass, dtype: boolean

In [37]:
df.pclass.astype("string").str.isnumeric().head(4)  # pclass sütunundaki verilerin numeric olup olmadığına bakmak için

0    True
1    True
2    True
3    True
Name: pclass, dtype: boolean

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [39]:
df["age"] = df["age"].replace(np.nan, "UNKNOWN")
df.groupby("age")["age"].count()

age
0.42         1
0.67         1
0.75         2
0.83         2
0.92         1
          ...
70.5         1
71.0         2
74.0         1
80.0         1
UNKNOWN    177
Name: age, Length: 89, dtype: int64

In [40]:
df.sibsp.astype("string").str.contains("1")  #

0       True
1       True
2      False
3       True
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: sibsp, Length: 891, dtype: boolean

In [41]:
df[df.sibsp.astype("string").str.contains("1")]  # sbips sütununda 1 içerenleri filtreledik.

# pd.Series.str.contains()  bunu docstringe bakmak için yazdım.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,MALE,22.0,1,0,7.2500,S,Third,man,True,NaN,southampton,no,False
1,1,1,FEMALE,38.0,1,0,71.2833,C,First,woman,False,C,cherbourg,yes,False
3,1,1,FEMALE,35.0,1,0,53.1000,S,First,woman,False,C,southampton,yes,False
9,1,2,FEMALE,14.0,1,0,30.0708,C,Second,child,False,NaN,cherbourg,yes,False
10,1,3,FEMALE,4.0,1,1,16.7000,S,Third,child,False,G,southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
866,1,2,FEMALE,27.0,1,0,13.8583,C,Second,woman,False,NaN,cherbourg,yes,False
869,1,3,MALE,4.0,1,1,11.1333,S,Third,child,False,NaN,southampton,yes,False
871,1,1,FEMALE,47.0,1,1,52.5542,S,First,woman,False,D,southampton,yes,False
874,1,2,FEMALE,28.0,1,0,24.0000,C,Second,woman,False,NaN,cherbourg,yes,False
888,0,3,FEMALE,UNKNOWN,1,2,23.4500,S,Third,woman,False,NaN,southampton,no,False

In [42]:
df.sex.str.split("MALE").head()

0      [, ]
1    [FE, ]
2    [FE, ]
3    [FE, ]
4      [, ]
Name: sex, dtype: object

In [43]:
df.sex.str.split("ALE").head()

0      [M, ]
1    [FEM, ]
2    [FEM, ]
3    [FEM, ]
4      [M, ]
Name: sex, dtype: object

In [44]:
df.sex.str.strip("LE")  # belirtilen patterni stringlerden silmek için

0        MA
1      FEMA
2      FEMA
3      FEMA
4        MA
       ...
886      MA
887    FEMA
888    FEMA
889      MA
890      MA
Name: sex, Length: 891, dtype: object

In [45]:
df.embark_town.str.find("Southampton").head(2)  # belirtilen ifadenin ilk bulunduğu index değerini bulmak için

0   -1.0
1   -1.0
Name: embark_town, dtype: float64

In [46]:
df.embark_town.str.findall("southampton").head(2)  # belirtilen ifadeden df'te varsa tamamının listesini döndürür.

0    [southampton]
1               []
Name: embark_town, dtype: object